I've switched the HCL to `type = "SPF"` and I see this in the plan

```hcl
 # dnsimple_zone_record.spf_records will be created
  + resource "dnsimple_zone_record" "spf_records" {
      + id               = (known after apply)
      + name             = "@"
      + priority         = (known after apply)
      + qualified_name   = (known after apply)
      + ttl              = 3600
      + type             = "SPF"
      + value            = "v=spf1 include:amazonses.com ~all"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "prettierbaby.org"
    }
```

The SPF record is successfully created, and I see you generate the corresponding TXT record, but the error persists:

```
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to dnsimple_zone_record.spf_records, provider "provider[\"registry.terraform.io/dnsimple/dnsimple\"]" produced an unexpected new value:
│ .name: was cty.StringVal("@"), but now cty.StringVal("").
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```

